spec/fixtures/vcr_cassettes/conekta_user_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://szrMg5UXExCA7JJriEdH:@api.conekta.io/charges?amount=19500&card=tok_test_visa_4242&currency=MXN&description=Servicio%20aliada&reference_id=61
    body:
      encoding: UTF-8
      string: ''
    headers:
      User-Agent:
      - Conekta/v1 RubyBindings/0.5.2
      X-Conekta-Client-User-Agent:
      - '{"bindings_version":"0.5.2","lang":"ruby","lang_version":"2.1.5","publisher":"conekta","uname":{"sysname":"Darwin","nodename":"grillermo.local","release":"13.4.0","version":"Darwin
        Kernel Version 13.4.0: Wed Dec 17 19:05:52 PST 2014; root:xnu-2422.115.10~1/RELEASE_X86_64","machine":"x86_64","model":"MacBookPro10,1"}}'
      Accept:
      - application/vnd.conekta-v1.0.0+json
      Accept-Language:
      - es
      Content-Length:
      - '0'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Conekta-Media-Type:
      - conekta-v1.0.0; format=json
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Tue, 17 Mar 2015 17:48:39 GMT
      Etag:
      - '"dc8b77d3d65b606ae828728a25c6a1df"'
      Server:
      - nginx/1.1.19
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Request-Id:
      - 207518076278d0f137db1c6dbc6a81fd
      X-Runtime:
      - '3.346843'
      Content-Length:
      - '640'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"id":"550868f319ce8857b40046d2","livemode":false,"created_at":1426614515,"status":"paid","currency":"MXN","description":"Servicio
        aliada","reference_id":"61","failure_code":null,"failure_message":null,"monthly_installments":null,"object":"charge","amount":19500,"paid_at":1426614519,"fee":946,"customer_id":"","refunds":[],"payment_method":{"name":"Jorge
        Lopez","exp_month":"12","exp_year":"19","auth_code":"000000","object":"card_payment","type":"credit","last4":"4242","brand":"visa","issuer":"","account_type":"","country":"US","fraud_score":null,"fraud_indicators":[]},"details":{"name":null,"phone":null,"email":null,"line_items":[]}}'
    http_version: 
  recorded_at: Tue, 17 Mar 2015 17:47:09 GMT
recorded_with: VCR 2.9.3
